<template>
    <div class="home">
        <h1>你好欢迎访问我的个人网站</h1>
        <section>
            本人热情随和，活波<a href="#">我爱你</a>开朗，具有进取精神和团队精神，有较强的动手能力。良好协调沟通能力，适应力强，反应快、积极、细心、灵活， 具有一定的社会交往能力。

            所以我需要找一份与自身知识结构相关的工作来展<a href="#">我爱你</a>示自己的能力，在学习中，我注重理论与实践的结合，己具备了相当的实践操作能力。<a href="#">我爱你</a>
            很强的事业心和责任感使我能够面对任何困难和挑战。
        </section>
        
        <section>
            本人热情随和，活波开朗，具有进取精神和团队精神<a href="#">我爱你</a>，有较强的动手能力。良好协调沟通能力，适应力强，反应快、积极、细心、灵活， 具有一定的社会交往能力。

            所以我需要找一份与自身知识结构相关的工作来展<a href="#">我爱你</a>示自己的能力，在学习中，我注重理论与实践的结合，己具备了相当的实践操作能力。
            很强的事业心和责任感使我能够面对任何<a href="#">我爱你</a>困难和挑战。
        </section>
        <section>
            本人热情随和，活波开朗，具有进取精神和团队精神，有较强的动<a href="#">我爱你</a>手能力。良好协调沟通能力，适应力强，反应快、积极、细心、灵活， 具有一定的社会交往能力。<a href="#">我爱你</a>

            所以我需要找一份与自身知识结构相关的工作来展示自己的能力，<a href="#">我爱你</a>在学习中，我注重理论与实践的结合，己具备了相当的实践操作能力。
            很强的事业心和责任感使我能够面<a href="#">我爱你</a>对任何困难和挑战。
        </section>
    </div>
</template>

<script setup>
</script>

<style lang="scss">
.home {
    color: #bbbbbb;
    h1 {
        margin-bottom: 30px;
    }
    section{
        margin: 20px 0;
        a{
            color: #fff;
            border-bottom: 1px solid rgba(125,125,125,.3);
            transition: border .4s;
            margin: 0 3px;
            &:hover{
                border-bottom: 1px solid #fff;
            }
        }
    }
}
</style>